# Logistic Regression

In [268]:
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import math

In [269]:
dataset=pd.read_csv('titanic.csv')

In [270]:
dataset.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [271]:
dataset.drop("Cabin",axis=1,inplace=True)
dataset.drop("Name",axis=1,inplace=True)
dataset.drop("Ticket",axis=1,inplace=True)
dataset.drop("PassengerId",axis=1,inplace=True)

In [272]:
dataset.head(5)

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [273]:
dataset['Age'].fillna((dataset['Age'].median()), inplace=True)

In [274]:
x=dataset.drop("Survived",axis=1)
y=dataset['Survived']

In [275]:

x.Embarked=x.Embarked.map({'S':0,'C':1,'Q':2})
x.Sex=x.Sex.map({'male':1,'female':2})
x.head(5)

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    1  22.0      1      0   7.2500       0.0
1       1    2  38.0      1      0  71.2833       1.0
2       3    2  26.0      0      0   7.9250       0.0
3       1    2  35.0      1      0  53.1000       0.0
4       3    1  35.0      0      0   8.0500       0.0

In [276]:
x=x.drop("Embarked",axis=1)
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(x,y,test_size=0.2)

In [277]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [278]:
model.fit(X_train,y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [279]:
model.score(X_test,y_test)

0.8100558659217877